Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: A detailed reference for the structure and composition of Quarkus documentation.
ja_jp: Quarkus ドキュメントの構造と設定に関する詳細なリファレンスです。

source: A directory for the codestart files, ie `my-codestart/`
ja_jp: Codestartファイルを置くディレクトリ、つまり `my-codestart/`

source: A failure handler can declare a single method parameter whose type extends `Throwable`. The type of the parameter is used to match the result of `RoutingContext#failure()`.
ja_jp: 失敗ハンドラーは、タイプが `Throwable` を拡張する単一のメソッドパラメーターを宣言できます。パラメーターのタイプは、 `RoutingContext#failure()` の結果と一致させるために使用されます。

source: A feature can be registered in a <<Build Step Processors>> method that produces a `FeatureBuildItem`:
ja_jp: フィーチャーは、 `FeatureBuildItem` を生成する link:#Build Step Processors[[Build Step Processors]]メソッドで登録することができます。

source: A feature can be registered in a <<build-step-processors>> method that produces a `FeatureBuildItem`:
ja_jp: 特徴は `FeatureBuildItem` を生成する <<build-step-processors>> メソッドで登録できます:

source: A few comments on this one:
ja_jp: これについてのコメントをいくつか。

source: A few common examples
ja_jp: いくつかの一般的な例

source: A few days ago, we released the https://github.com/quarkiverse/quarkus-chicory/releases/tag/0.0.1[first version of Quarkus Chicory], an extension that brings the power of the https://github.com/dylibso/chicory[Chicory WebAssembly runtime] to Quarkus applications.
ja_jp: 数日前、我々は https://github.com/quarkiverse/quarkus-chicory/releases/tag/0.0.1[Quarkus Chicory の最初のバージョン] をリリースしました。これは、 https://github.com/dylibso/chicory[Chicory WebAssembly ランタイム] のパワーを Quarkus アプリケーションにもたらすエクステンションです。

source: A few issues
ja_jp: いくつかの問題点

source: A few months ago, we started working on making our builds faster (see this https://quarkus.io/blog/building-large-applications/[blog post] for all the gory details). With Quarkus 3.31, we are introducing a new Maven packaging type called `quarkus`, designed to provide a more integrated and significantly more efficient build lifecycle.
ja_jp: 数ヶ月前、私たちはビルドを高速化することに取り組み始めました（詳細については、この link:https://quarkus.io/blog/building-large-applications/[ブログ記事] を参照してください）。Quarkus 3.31では、より統合され、大幅に効率的なビルドライフサイクルを提供するように設計された、 `quarkus` と呼ばれる新しいMavenパッケージングタイプを導入しています。

source: A few months back, I blogged about https://quarkus.io/blog/kafka-avro/[Quarkus, Kafka, and Avro] (using the Apicurio schema registry).
ja_jp: 数ヶ月前に、 https://quarkus.io/blog/kafka-avro/[QuarkusとKafka、Avro] (Apicurio schema registryを使用)についてブログを書きました。

source: A few recommendations:
ja_jp: 幾つかの推奨事項:

source: A few tasks performed by the Ansible collection for Quarkus will require administrative privileges on the target (create a group and user account, install packages). If Ansible does run as root, you'll need to add the following options to the `ansible-playbook` command line:
ja_jp: Quarkus用のAnsibleコレクションで実行されるいくつかのタスクは、ターゲットの管理者権限を必要とします（グループとユーザーアカウントの作成、パッケージのインストール）。Ansibleをroot権限で実行する場合は、 `ansible-playbook` のコマンドラインに以下のオプションを追加する必要があります：

source: A few things to note:
ja_jp: 以下の点に注意してください。

source: A first concern is whether custom extensions should depend on Quarkus REST explicitly, or alternatively support both RESTEasy flavors and leave it to the user to decide. If the extension is some general purpose extension, it probably makes sense to choose the latter option, while the former option is easiest to adopt when the custom extension is used by a specific set of users / applications.
ja_jp: 最初の懸念は、カスタムエクステンションが Quarkus REST に明示的に依存する必要があるか、または代わりに両方の RESTEasy フレーバーをサポートしてユーザーに決定させるかということです。 エクステンションが汎用的である場合は、後者のオプションを選択するのが理にかなっている可能性がありますが、前者は、カスタムのエクステンションが 特定のユーザー/アプリケーションセットによって使用されている場合には最も簡単なオプションです。

source: A first concern is whether custom extensions should depend on RESTEasy Reactive explicitly, or alternatively support both RESTEasy flavors and leave it to the user to decide. If the extension is some general purpose extension, it probably makes sense to choose the latter option, while the former option is easiest to adopt when the custom extension is used by a specific set of users / applications.
ja_jp: カスタムエクステンションはRESTEasy Reactiveに明示的に依存するか、RESTEasyの両方のフレーバーをサポートし、ユーザーの判断に委ねるかが最初の関心事です。エクステンションが汎用的なものであれば、後者のオプションを選択することが理にかなっていると思われます。

source: A flexible way for extensions to expose configuration, documentation, and actions
ja_jp: エクステンションが設定、ドキュメント、アクションを公開するための柔軟な方法

source: A fragment represents a part of a template that can be treated as a separate template, i.e. rendered separately. One of the main motivations to introduce this feature was the support of use cases like https://htmx.org/essays/template-fragments/[htmx fragments].
ja_jp: フラグメントはテンプレートの一部を表し、個別のテンプレートとして扱うことができます。 この機能を導入する主な動機の1つは、 link:https://htmx.org/essays/template-fragments/[htmxフラグメント] のようなユースケースをサポートすることでした。

source: A fragment represents a part of the template that can be treated as a separate template, i.e. rendered separately. One of the main motivations to introduce this feature was to support use cases like https://htmx.org/essays/template-fragments/[htmx fragments].
ja_jp: フラグメントは、別個のテンプレートとして扱える、つまり別々にレンダリングできるテンプレートの一部分を表します。この機能を導入した主な動機の1つは、 link:https://htmx.org/essays/template-fragments/[htmxフラグメント] のようなユースケースをサポートするためでした。

source: A framework at runtime typically reads configuration, scan the classpath and classes for metadata (annotations, getters etc), build a metamodel on top of which it runs, find options via the service loader pattern, prepare invocation calls (reflection), proxy interfaces, etc. + These operations should be done at build time and the metamodel be passed to the recorder DSL that will generate classes that will be executed at runtime and boot the framework.
ja_jp: 実行時のフレームワークは通常、設定を読み込み、クラスパスとクラスをスキャンしてメタデータ(アノテーションやゲッターなど)を探し、その上にメタモデルを構築し、サービスローダパターンを介してオプションを見つけ、実行呼び出し(リフレクション)やプロキシインターフェイスなどを準備します。これらの操作はビルド時に行われ、メタモデルは実行時に実行されるクラスを生成するレコーダDSLに渡され、フレームワークを起動します。

source: A framework at runtime typically reads configuration, scan the classpath and classes for metadata (annotations, getters etc.), build a metamodel on top of which it runs, find options via the service loader pattern, prepare invocation calls (reflection), proxy interfaces, etc. + These operations should be done at build time and the metamodel be passed to the recorder DSL that will generate classes that will be executed at runtime and boot the framework.
ja_jp: 実行時のフレームワークは通常、設定を読み込み、クラスパスとクラスをスキャンしてメタデータ (アノテーションやゲッターなど) を探し、その上にメタモデルを構築し、サービスローダパターンを介してオプションを見つけ、実行呼び出し (リフレクション) やプロキシインターフェイスなどを準備します。これらの操作はビルド時に行われ、メタモデルは実行時に実行されるクラスを生成するレコーダ－ DSL に渡され、フレームワークを起動します。

source: A framework for developing extensions that facilitate implementing patterns such as the build time initialization
ja_jp: ビルド時の初期化などのパターンを実現するためのエクステンションを開発するためのフレームワーク

source: A frontend
ja_jp: フロントエンド

source: A gRPC client injection point must be annotated with the `@GrpcClient` qualifier. This qualifier can be used to specify the name that is used to configure the underlying gRPC client. For example, if you set it to `hello-service`, configuring the host of the service is done using the `quarkus.grpc.clients.**hello-service**.host`.
ja_jp: gRPCクライアントのインジェクションポイントには、 `@GrpcClient` の修飾子を付ける必要があります。この修飾子は、基礎となるgRPCクライアントの設定に使用される名前を指定するために使用できます。たとえば、この修飾子を `hello-service` に設定すると、サービスのホストの設定は、 `quarkus.grpc.clients.**hello-service**.host` を使用して行われるようになります。

source: A gRPC client interceptor can be implemented by a CDI bean that also implements the `io.grpc.ClientInterceptor` interface. You can annotate an injected client with `@io.quarkus.grpc.RegisterClientInterceptor` to register the specified interceptor for the particular client instance. The `@RegisterClientInterceptor` annotation is repeatable. Alternatively, if you want to apply the interceptor to any injected client then annotate the interceptor bean with `@io.quarkus.grpc.GlobalInterceptor`.
ja_jp: gRPCクライアントインターセプターは、 `io.grpc.ClientInterceptor` インターフェースも実装する CDI Bean で実装できます。インジェクトされたクライアントに `@io.quarkus.grpc.RegisterClientInterceptor` のアノテーションを付加することで、特定のクライアントインスタンスに対して指定されたインターセプターを登録できます。 `@RegisterClientInterceptor` のアノテーションは繰り返し使用できます。また、注入されたクライアントにインターセプターを適用したい場合は、インターセプターBeanに `@io.quarkus.grpc.GlobalInterceptor` のアノテーションを付けます。

source: A gRPC service implementation bean must be annotated with the `@GrpcService` annotation and should not declare any other CDI qualifier. All gRPC services have the `jakarta.inject.Singleton` scope. Additionally, the request context is always active during a service call.
ja_jp: gRPCサービス実装Beanは、 `@GrpcService` アノテーションを付けなければならず、他のCDI修飾子を宣言してはいけません。すべてのgRPCサービスは、 `jakarta.inject.Singleton` のスコープを持ちます。さらに、サービス呼び出しの間、リクエストコンテキストが有効になります。

source: A gRPC service implementation bean must be annotated with the `@GrpcService` annotation and should not declare any other CDI qualifier. All gRPC services have the `javax.inject.Singleton` scope. Additionally, the request context is always active during a service call.
ja_jp: gRPCサービス実装Beanは、 `@GrpcService` アノテーションを付加されなければならず、他のCDI修飾子を宣言してはいけません。すべてのgRPCサービスは、 `javax.inject.Singleton` スコープを持ちます。また、サービスコール中は常にリクエストコンテキストが有効になります。

source: A given Panache entity can be attached to only a single persistence unit.
ja_jp: 1つのPanacheエンティティは、1つの永続化ユニットにしかアタッチできません。

source: A global configuration example:
ja_jp: グローバル設定の例：

source: A global world tour takes an entire community to ensure its success. We have a great group of roadies that have made the world tour a success so far but we need your help.
ja_jp: グローバルなワールドツアーを成功させるには、コミュニティ全体が必要です。これまでワールドツアーを成功させてきた素晴らしいローディたちがいますが、皆さんの協力が必要です。

source: A good application includes test coverage.
ja_jp: 優れたアプリケーションには、テストカバレッジが含まれます。

source: A good example of creating `ClientMultipartForm` is one where it is created from the server's `MultipartFormDataInput` (which represents a multipart request received by xref:rest.adoc#multipart[Quarkus REST]) - the purpose being to propagate the request downstream while allowing for arbitrary modifications:
ja_jp: `ClientMultipartForm` を作成する良い例は、サーバーの `MultipartFormDataInput` (xref:rest.adoc#multipart[Quarkus REST] によって受信されたマルチパートリクエストを表す) から作成されるものです。その目的は、任意の変更を許可しながらリクエストをダウンストリームに伝播することです。

source: A good example of this is the SmallRye OpenAPI extension that contains links to the generated OpenAPI schema in both JSON and YAML format, and a link to Swagger UI:
ja_jp: その良い例としては、JSON と YAML の両方のフォーマットで生成された OpenAPI スキーマへのリンクと、Swagger UI へのリンクが含まれる SmallRye OpenAPI エクステンションが挙げられます。

source: A good heuristic when migrating to the new model is that all static fields should go away. For example, remove all fields like these ones:
ja_jp: 新しいモデルに移行する際の優れたヒューリスティックは、すべての静的フィールドをなくすことです。たとえば、次のようなフィールドをすべて削除します。

source: A good walkthrough of the issue is https://www.youtube.com/watch?v=lJ8ydIuPFeU[this video] where Gil Tene the author of wrk2 explains the issue and https://www.youtube.com/watch?v=xdG8b9iDYbE[Quarkus Insights #22] have John O'Hara from Quarkus performance team show how it can show up.
ja_jp: https://www.youtube.com/watch?v=lJ8ydIuPFeU[このビデオ] で、wrk2 の作者である Gil Tene がこの問題について説明しています。 https://www.youtube.com/watch?v=xdG8b9iDYbE[Quarkus Insights #22] では、Quarkus パフォーマンス チームの John O'Hara が、それがどのように現れるか説明しています。

source: A gradual refactoring effort is underway to reshape Quarkus documentation to make it easier to both read and write (see xref:doc-concepts.adoc[Quarkus documentation concepts] for more on this transition).
ja_jp: Quarkusのドキュメントを読みやすく、書きやすくするために、段階的なリファクタリングが行われています（この移行については、 link:doc-concepts.html[Quarkusドキュメントのコンセプト] を参照してください）。

source: A gradual refactoring effort is underway to reshape Quarkus documentation to make it easier to both read and write. For more information about this transition, see xref:doc-concept.adoc[Quarkus documentation content types].
ja_jp: Quarkusのドキュメントを読みやすく、書きやすくするために、段階的なリファクタリングの取り組みが行われています。この移行についての詳細は、 xref:doc-concept.adoc[Quarkusドキュメントのコンテンツタイプ] を参照してください。

source: A high level overview of what the various steps of a CI/CD pipeline would look is the following:
ja_jp: CI/CD パイプラインのさまざまなステップがどのように見えるかについて、以下に概要を示しています。

source: A https://datatracker.ietf.org/doc/html/rfc6455#section-5.5.2[ping message] may serve as a keepalive or to verify the remote endpoint. A https://datatracker.ietf.org/doc/html/rfc6455#section-5.5.3[pong message] is sent in response to a ping message and it must have an identical payload.
ja_jp: https://datatracker.ietf.org/doc/html/rfc6455#section-5.5.2[ping メッセージ] は、キープアライブとして、またはリモートエンドポイントを確認するために使用できます。 https://datatracker.ietf.org/doc/html/rfc6455#section-5.5.3[pong メッセージ] は、ping メッセージへのレスポンスとして送信され、同一のペイロードを持つ必要があります。

source: A https://github.com/open-telemetry/opentelemetry-specification/blob/main/specification/overview.md#resources[resource] is a representation of the entity that is producing telemetry, it adds attributes to the exported trace or metric to characterize who is producing the telemetry. Quarkus follows the https://opentelemetry.io/docs/languages/java/configuration/#resources[resources auto-configuration] specified by the Java OpenTelemetry SDK.
ja_jp: https://github.com/open-telemetry/opentelemetry-specification/blob/main/specification/overview.md#resources[リソース] は、テレメトリを生成しているエンティティーの表現です。 エクスポートされたトレースまたはメトリクスに属性を追加し、何がテレメトリを生成しているかを示します。Quarkus は、Java OpenTelemetry SDK で指定された https://opentelemetry.io/docs/languages/java/configuration/#resources[リソースの自動設定] に従います。

source: A https://github.com/open-telemetry/opentelemetry-specification/blob/main/specification/overview.md#resources[resource] is a representation of the entity that is producing telemetry, it adds attributes to the exported trace to characterize who is producing the trace.
ja_jp: link:https://github.com/open-telemetry/opentelemetry-specification/blob/main/specification/overview.md#resources[リソース]は、テレメトリを生成しているエンティティの表現であり、誰がトレースを生成しているかを特徴づけるために、エクスポートされたトレースに属性を追加します。

source: A https://github.com/open-telemetry/opentelemetry-specification/blob/main/specification/trace/sdk.md#sampling[sampler] decides whether a trace should be sampled and exported, controlling noise and overhead by reducing the number of sample of traces collected and sent to the collector.
ja_jp: link:https://github.com/open-telemetry/opentelemetry-specification/blob/main/specification/trace/sdk.md#sampling[サンプラー]は、トレースをサンプリングしてエクスポートするかどうかを決定し、収集してコレクターに送信するトレースのサンプル数を減らすことで、ノイズやオーバーヘッドを制御します。

source: A https://github.com/open-telemetry/opentelemetry-specification/blob/main/specification/trace/sdk.md#sampling[sampler] decides whether a trace should be discarded or forwarded, effectively managing noise and reducing overhead by limiting the number of collected traces sent to the collector.
ja_jp: https://github.com/open-telemetry/opentelemetry-specification/blob/main/specification/trace/sdk.md#sampling[サンプラー] は、トレースを破棄するか転送するかを決定し、コレクターに送信される収集されたトレースの数を制限することで、ノイズを効果的に管理し、オーバーヘッドを削減します。

source: A https://quarkus.io/blog/resteasy-reactive/[loooong time ago], we introduced in Quarkus a new REST layer called RESTEasy Reactive. This new REST implementation has been designed with Quarkus in mind and offers some nice improvements over the traditional RESTEasy stack that we were pushing by default until now.
ja_jp: link:https://quarkus.io/blog/resteasy-reactive/[ずいぶん前]になりますが、QuarkusにRESTEasy Reactiveという新しいRESTレイヤーを導入しました。この新しいREST実装は、Quarkusを念頭に置いて設計されており、これまでデフォルトでプッシュしていた従来のRESTEasyスタックよりも優れた改善を提供しています。

source: A https://quarkus.io/guides/platform#quarkus-platform-bom[Quarkus Platform release BOM] is identified by `groupId:artifactId:version` (GAV) coordinates. When specifying a platform release BOM, you may use empty segments to fall back to default values (shown with `quarkus create app --help`). If you specify only one segment (no `:`), it is assumed to be a version.
ja_jp: link:https://quarkus.io/guides/platform#quarkus-platform-bom[QuarkusプラットフォームのリリースBOM] は、 `groupId:artifactId:version` （GAV）座標で識別されます。プラットフォームリリースのBOMを指定する場合、空のセグメントを使用してデフォルト値（ `quarkus create app --help` ）に戻すことができます。セグメントを1つだけ指定した場合（ `:` を指定しない場合）、そのセグメントはバージョンであると見なされます。

source: A https://quarkus.io/guides/platform#quarkus-platform-bom[Quarkus Platform release BOM] is identified by `groupId:artifactId:version` (GAV) coordinates. When specifying a platform release BOM, you may use empty segments to fallback to default values (shown with `quarkus create app --help`). If you specify only one segment (no `:`), it is assumed to be a version.
ja_jp: link:https://quarkus.io/guides/platform#quarkus-platform-bom[QuarkusプラットフォームのリリースBOM] は、 `groupId:artifactId:version` （GAV）座標で識別されます。プラットフォームリリースのBOMを指定する場合、空のセグメントを使用してデフォルト値（ `quarkus create app --help` ）にフォールバックすることができます。セグメントを1つだけ指定した場合（ `:` を指定しない場合）、そのセグメントはバージョンであると見なされます。

source: A job that was added programmatically can be also removed.
ja_jp: プログラムによって追加されたジョブも削除することができます。

source: A key to used when writing the record Type: _string_
ja_jp: レコードを書き込む際に使用するキー Type: _string_

source: A large REST CRUD application with 9,000 classes goes from **3 seconds** to **900 ms**.
ja_jp: 9,000 クラスを持つ大規模な REST CRUD アプリケーションは、**3 秒**から **900 ミリ秒**になります。

source: A later extension will provide better support for embedded coordinators (including configuring them using standard quarkus mechanisms).
ja_jp: 今後、エクステンションでは、埋め込み式のコーディネーターのサポートが強化される予定です（標準的なQuarkusのメカニズムを使った設定を含む）。

source: A leading slash changes how the configured permission path is interpreted. The configured URL is used as-is, and paths are not adjusted if the value of `quarkus.http.root-path` changes.
ja_jp: 先頭のスラッシュは、設定された権限パスの解釈方法を変更します。 設定された URL はそのまま使用され、 `quarkus.http.root-path` の値が変更されてもパスは調整されません。

source: A leading slash will change how the configured permission path is interpreted. The configured URL will be used as-is, and paths will not be adjusted if the value of `quarkus.http.root-path` is changed. For example:
ja_jp: 先頭のスラッシュは、設定されたパーミッションのパスの解釈方法を変更します。設定されたURLはそのまま使用され、 `quarkus.http.root-path` の値が変更されても、パスは調整されません。例えば下記の形です。 :

source: A link to the equivalent OpenTelemetry Semantic Convention is also provided for reference and is not currently used by the bridge.
ja_jp: 対応する OpenTelemetry Semantic Convention へのリンクも参考として提供されていますが、 現在このブリッジでは使用されていません。

source: A list element can be accessed directly via an index: `{list.10}` or even `{list[10]}`.
ja_jp: リストの要素にはインデックス (`{list.10}` または `{list[10]}`) を介して直接アクセスすることができます。

source: A list element can be accessed directly: `{list.10}` or `{list[10]}`.
ja_jp: list 要素に直接アクセスすることができます: `{list.10}` または `{list[10]}` .

source: A list of Clear-Site-Data header directives
ja_jp: Clear-Site-Data ヘッダーディレクティブのリスト

source: A list of HTTP methods that should be rejected with `405 Method Not Allowed`. Useful for disabling insecure methods such as `TRACE` or `TRACK`. Example: ---- quarkus.undertow.disallowed-methods=TRACE,TRACK ----
ja_jp: `405 Method Not Allowed` で拒否すべき HTTP メソッドのリスト。 `TRACE` や `TRACK` などの安全でないメソッドを無効にするのに便利です。 例: ---- quarkus.undertow.disallowed-methods=TRACE,TRACK ----

source: A list of all extensions that support Dev Services and their configuration options.
ja_jp: DevServicesをサポートするすべてのエクステンションとその設定オプションのリスト

source: A list of currently recommended Quarkus platform BOM updates
ja_jp: 現在推奨されている Quarkus プラットフォームの BOM 更新のリスト

source: A list of features installed in the runtime image
ja_jp: ランタイムイメージにインストールされているフィーチャーのリスト

source: A list of locale codes can be found here: https://simplelocalize.io/data/locales/
ja_jp: ロケールコードのリストは、こちらで確認できます: https://simplelocalize.io/data/locales/

source: A list of the currently recommended Quarkus platform BOM updates for the project
ja_jp: プロジェクトに対して現在推奨されている Quarkus プラットフォームの BOM 更新のリスト

source: A local running model (for Ollama or Podman AI)
ja_jp: ローカルで実行中のモデル (Ollama または Podman AI の場合)

source: A localized interface is the preferred solution mainly due to the possibility of easy refactoring.
ja_jp: ローカライズされたインターフェイスは、主にリファクタリングの容易性から、好ましい解決策です。

source: A locally-rendered result of asciidoc processing (which is similar, but not identical, to that used to generate website documentation) is found in `docs/target/generated-docs/`
ja_jp: asciidoc 処理のローカルレンダリング結果 (Web サイトのドキュメント生成に使われるものと似ていますが、同一ではありません) は、 `docs/target/generated-docs/` にあります。

source: A log handler is a logging component responsible for the emission of log events to a recipient. Quarkus comes with three different log handlers: **console**, **file** and **syslog**.
ja_jp: ログハンドラーは、受信者へのログイベントの送信を担当するロギングコンポーネントです。Quarkusには、 **コンソール** 、 **ファイル** 、 **syslog** という3つの異なるログハンドラーが用意されています。

source: A log handler is a logging component responsible for the emission of log events to a recipient. Quarkus includes several different log handlers: **console**, **file**, and **syslog**.
ja_jp: ログハンドラは、ログイベントを受信者に送信するロギングコンポーネントです。 Quarkusには、 *コンソール* 、 *ファイル* 、 *syslog* といった複数のログハンドラがあります。

source: A log handler is a logging component responsible for the emission of log events to a recipient. {project-name} includes several different log handlers: **console**, **file**, and **syslog**.
ja_jp: ログハンドラーは、ログイベントを受信者に送信するロギングコンポーネントです。 {project-name} には、 *コンソール* 、 *ファイル* 、 *syslog* といった複数のログハンドラーがあります。

source: A log handler is a logging component that emits log events to a recipient. {project-name} includes several different log handlers: **console**, **file**, and **syslog**.
ja_jp: ログハンドラーは、ログイベントを受信者に送出するロギングコンポーネントです。{project-name} には、**console**、**file**、**syslog** という数種類のログハンドラーが含まれています。

source: A lookup to `my.secret` will use the `SecretKeysHandler` name `aes-gcm-nopadding` to decode the value `DJNrZ6LfpupFv6QbXyXhvzD8eVDnDa_kTliQBpuzTobDZxlg`.
ja_jp: `my.secret` を読み出すと、 `aes-gcm-nopadding` という名前の `SecretKeysHandler` を使って、値 `DJNrZ6LfpupFv6QbXyXhvzD8eVDnDa_kTliQBpuzTobDZxlg` がデコードされます。

source: A lookup to `remote.host` with `-Dremote.host=` will throw an Exception, because the system property cleared the value.
ja_jp: `-Dremote.host=` を指定して `remote.host` を検索すると、システムプロパティーが値をクリアしたため、例外がスローされます。

source: A loop section may also define the `{#else}` block that is executed when there are no items to iterate:
ja_jp: ループセクションは、反復する項目がないときに実行される `{#else}` ブロックも定義することができます。

source: A lot of Google Cloud-related work is taking place in the https://github.com/quarkiverse/quarkiverse-google-cloud-services[Quarkiverse].
ja_jp: Google Cloud 関連の仕事の多くは https://github.com/quarkiverse/quarkiverse-google-cloud-services[Quarkiverse] で行われています。

source: A lot of Quarkus extensions are already covered and, in 2.1, we added link:/guides/security-openid-connect-dev-services[a Dev Service for Keycloak].
ja_jp: 多くのQuarkusのエクステンションがすでにカバーされており、2.1では link:/guides/security-openid-connect-dev-services[Dev Service for Keycloak]を追加しました。

source: A lot of Quarkus extensions are already covered and, in 2.3, we added link:/guides/neo4j[a Dev Service for Neo4J].
ja_jp: 多くのQuarkusのエクステンションはすでにカバーされており、2.3では link:/guides/neo4j[Dev Service for Neo4J]を追加しました。

source: A lot of effort was invested in optimizing various parts of the build process: reducing memory allocations and optimizing algorithms and data structures were a big part of it.
ja_jp: ビルドプロセスの様々な部分を最適化するために多大な努力が注がれました。メモリー割り当ての削減、アルゴリズムとデータ構造の最適化がその大きな部分を占めていました。

source: A lot of the properties in this state is really build time data that auto reload when a hot-reload happens.
ja_jp: この状態のプロパティーの多くは、実際にはビルド時データであり、ホットリロードが発生したときに自動的にリロードされます。

source: A lot of web applications are monotonous CRUD applications with REST APIs that are tedious to write. To streamline this task, REST Data with Panache extension can generate the basic CRUD endpoints for your entities and repositories.
ja_jp: 多くのWebアプリケーションは、REST APIを使った単調なCRUDアプリケーションで、書くのが面倒です。このタスクを合理化するために、REST Data with Panache エクステンションは、エンティティーやリポジトリの基本的なCRUDエンドポイントを生成することができます。
